In [1]:
import pandas as pd

In [2]:
data={"EmployeeID":[100,200,300,400,500,600],
      "Name":["Ria","Tina","Leena","Roy","Ajay","Anwar"],
      "Department":["Finance","Marketing","Accounting","Customerservice","Manager","HR"],
      "Salary":[20000,30000,45902,23457,24673,98765]
}
data

{'EmployeeID': [100, 200, 300, 400, 500, 600],
 'Name': ['Ria', 'Tina', 'Leena', 'Roy', 'Ajay', 'Anwar'],
 'Department': ['Finance',
  'Marketing',
  'Accounting',
  'Customerservice',
  'Manager',
  'HR'],
 'Salary': [20000, 30000, 45902, 23457, 24673, 98765]}

In [5]:
df=pd.DataFrame(data)
df

   EmployeeID   Name       Department  Salary
0         100    Ria          Finance   20000
1         200   Tina        Marketing   30000
2         300  Leena       Accounting   45902
3         400    Roy  Customerservice   23457
4         500   Ajay          Manager   24673
5         600  Anwar               HR   98765

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  6 non-null      int64
 1   Name        6 non-null      object
 2   Department  6 non-null      object
 3   Salary      6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [9]:
df.describe()

       EmployeeID        Salary
count    6.000000      6.000000
mean   350.000000  40466.166667
std    187.082869  29984.805281
min    100.000000  20000.000000
25%    225.000000  23761.000000
50%    350.000000  27336.500000
75%    475.000000  41926.500000
max    600.000000  98765.000000

In [11]:
df.head()

   EmployeeID   Name       Department  Salary
0         100    Ria          Finance   20000
1         200   Tina        Marketing   30000
2         300  Leena       Accounting   45902
3         400    Roy  Customerservice   23457
4         500   Ajay          Manager   24673

In [13]:
df.tail()

   EmployeeID   Name       Department  Salary
1         200   Tina        Marketing   30000
2         300  Leena       Accounting   45902
3         400    Roy  Customerservice   23457
4         500   Ajay          Manager   24673
5         600  Anwar               HR   98765

In [19]:
import pandas as pd

In [25]:
df=pd.read_csv(r"C:\Users\keert\Downloads\Employee.csv")
df

   EmployeeID     Name  Age  Department  Salary
0           1    Alice   25          HR    2500
1           2      Bob   26     Manager    3000
2           3  Charlie   27       Sales    3500
3           4      Eva   28          IT    3100
4           5    Fiona   29  Operations    4000

In [27]:
df.isnull()

   EmployeeID   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False  False       False   False
4       False  False  False       False   False

In [29]:
df.isnull().sum()

EmployeeID    0
Name          0
Age           0
Department    0
Salary        0
dtype: int64

In [31]:
df['Name'].unique()

array(['Alice', 'Bob', 'Charlie', 'Eva', 'Fiona'], dtype=object)

In [33]:
df['Department'].unique()

array(['HR', 'Manager', 'Sales', 'IT', 'Operations'], dtype=object)

In [35]:
df['Salary'].unique()

array([2500, 3000, 3500, 3100, 4000], dtype=int64)

In [37]:
df['Age'].unique()

array([25, 26, 27, 28, 29], dtype=int64)

In [39]:
df['EmployeeID'].unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [41]:
df.to_csv("Employee.csv",index=True)

In [43]:
Employee=pd.DataFrame(df)

In [45]:
Employee

   EmployeeID     Name  Age  Department  Salary
0           1    Alice   25          HR    2500
1           2      Bob   26     Manager    3000
2           3  Charlie   27       Sales    3500
3           4      Eva   28          IT    3100
4           5    Fiona   29  Operations    4000